Repository: xperseguers/t3ext-file_list
Catalog: Resources/Private/Language/*.locallang_flexform.xlf
Languages: de, fr

# filelist_title
source: File List - List of files
de: File List - Liste der Dateien
fr: File List - Liste de fichiers

# filelist_wizard_description
source: Makes a list of files and folders.
de: Erstellt eine Liste von Dateien und Ordnern.
fr: Crée une liste de fichiers et de dossiers.

# tabs.general
source: General
fr: Général

# tabs.appearance
source: Listing Appearance
de: Aussehen der Liste
fr: Apparence de la liste

# filelist.mode.folder
source: Files within a folder
de: Dateien eines Ordners
fr: Fichiers à l'intérieur d'un dossier

# filelist.mode.file_collections
source: Files from file collections
de: Dateien von Dateisammlung
fr: Fichiers depuis une collection de fichiers

# filelist.path
source: Restrict to folder path (example: file:1:/user_upload/)
de: Beschränken auf Pfad zum Ordner (z.B. file:1:/user_upload/)
fr: Restreindre au chemin du dossier (par ex. : file:1:/user_upload/)

# filelist.path.summary
source: Path
de: Pfad
fr: Chemin

# filelist.path.wizards.link.title
source: Folder selector
de: Ordnerauswahl
fr: Sélecteur de dossier

# filelist.includeSubfolders
source: Allow browsing to subfolders
de: Unterordner erlauben
fr: Autoriser la navigation dans les sous-dossiers

# filelist.orderBy
source: Sort files by
de: Sortieren nach
fr: Trier les fichiers par

# filelist.orderBy.name
source: Name
fr: Nom

# filelist.orderBy.title
source: Title
de: Titel
fr: Titre

# filelist.orderBy.date
source: Modification Date
fr: Date de modification

# filelist.orderBy.crdate
source: Creation Date
fr: Date de création

# filelist.orderBy.size
source: Size
de: Grösse
fr: Taille

# filelist.sortDirection
source: Sort sequence
de: Sortierreihenfolge
fr: Sens du tri

# filelist.sortDirection.asc
source: Ascending
de: Aufsteigend
fr: Croissant

# filelist.sortDirection.desc
source: Descending
de: Absteigend
fr: Décroissant

# filelist.file_collections
source: Select file collections
de: Wählen Sie Dateisammlungen
fr: Sélectionnez des collections de fichiers

# filelist.newDuration
source: Amount of days between a files creation date and the frontend visit date within which a file should be displayed as "new" (0 = disabled)
de: Anzahl der Tage zwischen einem Dateien Erstellungsdatum und dem Frontend Besuchstermin, in dem eine Datei als "neu" angezeigt werden sollte (0 = gesperrt)
fr: Nombre de jours entre la date de création du fichier et la date de visite pendant lesquels le fichier devrait être marqué comme "nouveau" (0 = désactivé)

# filelist.templateLayout
source: Layout
fr: Mise en page

# filelist.templateLayout.simple
source: Simple listing
de: Einfache Auflistung
fr: Liste simple

# filelist.templateLayout.thumbnailDescription
source: Thumbnail + description
de: Thumbnail + Beschreibung
fr: Miniature + description

# filelist.mode
source: Mode
de: Modus

# filelist.orderBy.description
source: Description
de: Beschreibung
